xeon/20240731-1457-glibc-default/logs/star-yes-128-32768-10/pgbench.log
pgbench (18devel)
transaction type: /home/tomas/lock-scalability-test/20240731-1457-glibc-default/logs/star-yes-128-32768-10/star-10-10.sql
scaling factor: 1
query mode: prepared
number of clients: 32
number of threads: 32
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 1549373
number of failed transactions: 0 (0.000%)
latency average = 0.206 ms
initial connection time = 17.034 ms
tps = 155188.239383 (without initial connection time)